'++++++++++++++++++++++++++++++++++set++++++++++++++++++++++++++++++'
# Множества - это изменяемый, неупорядочный, итерируемый, неиндексируемый тип данных предназначенный для хранения уникальных значений.
# Множества могут хранить в себе только незменяемые типы данных, если же в set использовать tuple, то внутри tuple не должно быть изменяемого типа данных

# set1 = {1,2,2,4,5,6,2,'hello', None,1}
# print(set1)

'=================FIFO / LIFO++++++++++++++++++++++++++'
# FIFO - first in first out
# LIFO - last in first out 
'==============================Метода set========================'
# print(dir(set()))
'----------------------'
# pop - удаляет случайный элемент из set 
# set2 = {1,2,3}
# popped = set2.pop()
# print(popped)
# print(set2)
'----------------------'
# add - добавляет элемент в set
# set3 = {1,2,3}
# set3.add(3) 
# print(set3) # {1, 2, 3}
'----------------------'
# remove - удаляет элемент из set по значению
# set4 = {1,2,3}
# set4.remove(3)
# print(set4)
'----------------------'
# difference (-)
# set1 = {1,2,3}
# set2 = {3,4,5}
# print(set1 - set2) # {1,2}
# print(set2 - set1) # {4,5}
# print(set1.difference(set2)) # {1, 2}
# print(set2.difference(set1)) # {4, 5}
'-----------------------'
# discard -  удаляет элемент из множества, если он присутствует. Если нет, то программа продолжает выполнение без ошибок:
# set4 = {1, 2, 3}
# set4.discard(3)
# print(set4)

# set3 = {5, 6, 7}
# set4 = {6, 8, 9}
# print(set3 - set4) # {5, 7}
# print(set4 - set3) # {8, 9}
'----------------------'
# symmetric_difference
# set1 = {1,2,3}
# set2 = {3,4,5}
# print(set1.symmetric_difference(set2)) # {1, 2, 4, 5}
# print(set1)
'----------------------'
# intersection (&)
# set1 = {1,2,3,4}
# set2 = {3,4,5,6}
# print(set1.intersection(set2)) # {3, 4}
# print(set1 & set2) # {3, 4}
'----------------------'
#union - объединяет 
# set1 = {1,2,3}
# set2 = {3,4,5,6}
# print(set1.union(set2))
'-----------------------'
# update 
# set1 = {1,2,3,4}
# set2 = {4,5,6,7}
# set1.update(set2)
# print(set1) # {1, 2, 3, 4, 5, 6, 7}

